# Excel 파일을 DataFrame으로 만들기

***5주차 수업 추가 정리***

In [ ]:
import numpy as np

In [ ]:
data = np.random.rand(3,5)
data

array([[0.18278607, 0.98036161, 0.48750395, 0.53216678, 0.57753577],
       [0.48667712, 0.79933353, 0.7778682 , 0.67054498, 0.05770779],
       [0.64412595, 0.50911922, 0.25108901, 0.96241842, 0.24816237]])

In [ ]:
import pandas as pd

In [ ]:
pd.read_excel('2020-01.xlsx')

                   상품명   판매건수     가격
0                   봉투  12362     50
1                  바나나   4285   3900
2                   야채   4190      0
3                 켐벨포도   2780  29800
4                 알뜰특란   2768   5300
..                 ...    ...    ...
195                바지락    253      0
196            해표)카놀라유    253   5600
197             오)자른당면    252   5850
198           롯데)알뜰소시지    252   4400
199  한돈앞다리/불고기,찌개(국내산)    252      0

[200 rows x 3 columns]

In [ ]:
df = pd.read_excel('2020-01.xlsx' ,index_col='상품명')

df.head()

       판매건수     가격
상품명
봉투    12362     50
바나나    4285   3900
야채     4190      0
켐벨포도   2780  29800
알뜰특란   2768   5300

In [ ]:
df.head(10)

        판매건수     가격
상품명
봉투     12362     50
바나나     4285   3900
야채      4190      0
켐벨포도    2780  29800
알뜰특란    2768   5300
딸기      2234      0
팔음산포도   2161  19800
봉투      2038     30
애호박     1962   1490
청양고추    1901      0

In [ ]:
df.tail()

                   판매건수    가격
상품명
바지락                 253     0
해표)카놀라유             253  5600
오)자른당면              252  5850
롯데)알뜰소시지            252  4400
한돈앞다리/불고기,찌개(국내산)   252     0

In [ ]:
df1 = df.nlargest(10, '판매건수')
df1

        판매건수     가격
상품명
봉투     12362     50
바나나     4285   3900
야채      4190      0
켐벨포도    2780  29800
알뜰특란    2768   5300
딸기      2234      0
팔음산포도   2161  19800
봉투      2038     30
애호박     1962   1490
청양고추    1901      0

In [ ]:
df1.plot()

In [ ]:
df1.plot(kind='pie', y='판매건수')

In [ ]:
df.nsmallest(10, '판매건수')

                   판매건수    가격
상품명
오)자른당면              252  5850
롯데)알뜰소시지            252  4400
한돈앞다리/불고기,찌개(국내산)   252     0
CJ)행콩나물             253  1950
바지락                 253     0
해표)카놀라유             253  5600
온동네광천파래재래김(전장)      255  2550
새송이버섯               255     0
CJ)주부초밥왕(소풍)        256  3750
황도복숭아               258     0

In [ ]:
df.nsmallest(10, ['판매건수', '가격'])

                   판매건수    가격
상품명
한돈앞다리/불고기,찌개(국내산)   252     0
롯데)알뜰소시지            252  4400
오)자른당면              252  5850
바지락                 253     0
CJ)행콩나물             253  1950
해표)카놀라유             253  5600
새송이버섯               255     0
온동네광천파래재래김(전장)      255  2550
CJ)주부초밥왕(소풍)        256  3750
황도복숭아               258     0

In [ ]:
df.sort_values?

In [ ]:
df.sort_values('가격', ascending=False) [:100]

              판매건수     가격
상품명
켐벨포도          2780  29800
감귤             297  29800
동서)맥심모카골드믹스    380  23800
팔음산포도         2161  19800
부사             844   9800
...            ...    ...
풀)액티비아컵(플레인)   488   2350
롯데)제주감귤        632   2350
해)킨사이다         302   2250
크린백(중）25*35    378   2250
동원)마일드참치       576   2250

[100 rows x 2 columns]

In [ ]:
df.sort_values('가격', ascending=False) [100:200]

                   판매건수    가격
상품명
쌈배추                 708  2150
풀)국산콩나물             260  2100
강릉심층수팩두부            444  2000
빙)굿모닝우유             710  1980
브로컬리                462  1980
...                 ...   ...
특수야채류               520     0
켐벨포도                552     0
숙주                  584     0
봄동                  636     0
한돈앞다리/불고기,찌개(국내산)   252     0

[100 rows x 2 columns]

---